[
    {
        "rank": "1",
        "imdbId": "tt0033467",
        "checked": false,
        "favorite": false,
        "movieTitle": "Citizen Kane",
        "posterPath": "/sav0jxhqiH0bPr2vZFU0Kjt2nZL.jpg",
        "overview": "Newspaper magnate, Charles Foster Kane is taken from his mother as a boy and made the ward of a rich industrialist. As a result, every well-meaning, tyrannical or self-destructive move he makes for the rest of his life appears in some way to be a reaction to that deeply wounding event.",
        "id": "tt0033467",
        "year": "1941"
    },
    {
        "rank": "2",
        "imdbId": "tt0068646",
        "checked": false,
        "favorite": false,
        "movieTitle": "The Godfather",
        "posterPath": "/3bhkrj58Vtu7enYsRolD1fZdja1.jpg",
        "overview": "Spanning the years 1945 to 1955, a chronicle of the fictional Italian-American Corleone crime family. When organized crime family patriarch, Vito Corleone barely survives an attempt on his life, his youngest son, Michael steps in to take care of the would-be killers, launching a campaign of bloody revenge.",
        "id": "tt0068646",
        "year": "1972"
    },
    {
        "rank": "3",
        "imdbId": "tt0034583",
        "checked": false,
        "favorite": false,
        "movieTitle": "Casablanca",
        "posterPath": "/5K7cOHoay2mZusSLezBOY0Qxh8a.jpg",
        "overview": "In Casablanca, Morocco in December 1941, a cynical American expatriate meets a former lover, with unforeseen complications.",
        "id": "tt0034583",
        "year": "1942"
    },
    {
        "rank": "4",
        "imdbId": "tt0081398",
        "checked": false,
        "favorite": false,
        "movieTitle": "Raging Bull",
        "posterPath": "/rEviyDWNbAFmvvCPlkMRPAGUElG.jpg",
        "overview": "The life of boxer Jake LaMotta, whose violence and temper that led him to the top in the ring destroyed his life outside of it.",
        "id": "tt0081398",
        "year": "1980"
    },
    {
        "rank": "5",
        "imdbId": "tt0045152",
        "checked": false,
        "favorite": false,
        "movieTitle": "Singin' in the Rain",
        "posterPath": "/671EPwBsHGHBk0cdOeZqmOK0XB3.jpg",
        "overview": "In 1927 Hollywood, a silent film production company and cast make a difficult transition to sound.",
        "id": "tt0045152",
        "year": "1952"
    },
    {
        "rank": "6",
        "imdbId": "tt0031381",
        "checked": false,
        "favorite": false,
        "movieTitle": "Gone with the Wind",
        "posterPath": "/7K5hvvoM2Of1fgEgUSveNE6DNe7.jpg",
        "overview": "The spoiled daughter of a well-to-do plantation owner is forced to use every means at her disposal to claw her way out of poverty, following Maj. Gen. William Sherman's \"March to the Sea,” during the American Civil War.",
        "id": "tt0031381",
        "year": "1939"
    },
    {
        "rank": "7",
        "imdbId": "tt0056172",
        "checked": false,
        "favorite": false,
        "movieTitle": "Lawrence of Arabia",
        "posterPath": "/AiAm0EtDvyGqNpVoieRw4u65vD1.jpg",
        "overview": "The story of British officer T.E. Lawrence's mission to aid the Arab tribes in their revolt against the Ottoman Empire during the First World War. Lawrence becomes a flamboyant, messianic figure in the cause of Arab unity but his psychological instability threatens to undermine his achievements.",
        "id": "tt0056172",
        "year": "1962"
    },
    {
        "rank": "8",
        "imdbId": "tt0108052",
        "checked": false,
        "favorite": false,
        "movieTitle": "Schindler's List",
        "posterPath": "/sF1U4EUQS8YHUYjNl3pMGNIQyr0.jpg",
        "overview": "The true story of how businessman Oskar Schindler saved over a thousand Jewish lives from the Nazis while they worked as slaves in his factory during World War II.",
        "id": "tt0108052",
        "year": "1993"
    },
    {
        "rank": "9",
        "imdbId": "tt0052357",
        "checked": false,
        "favorite": false,
        "movieTitle": "Vertigo",
        "posterPath": "/15uOEfqBNTVtDUT7hGBVCka0rZz.jpg",
        "overview": "A retired San Francisco detective suffering from acrophobia investigates the strange activities of an old friend's wife, all the while becoming dangerously obsessed with her.",
        "id": "tt0052357",
        "year": "1958"
    },
    {
        "rank": "10",
        "imdbId": "tt0032138",
        "checked": false,
        "favorite": false,
        "movieTitle": "The Wizard of Oz",
        "posterPath": "/bSA6DbAC5gdkaooU164lQUX6rVs.jpg",
        "overview": "Young Dorothy finds herself in a magical world where she makes friends with a lion, a scarecrow and a tin man as they make their way along the yellow brick road to talk with the Wizard and ask for the things they miss most in their lives. The Wicked Witch of the West is the only thing that could stop them.",
        "id": "tt0032138",
        "year": "1939"
    },
    {
        "rank": "11",
        "imdbId": "tt0021749",
        "checked": false,
        "favorite": false,
        "movieTitle": "City Lights",
        "posterPath": "/bXNvzjULc9jrOVhGfjcc64uKZmZ.jpg",
        "overview": "In this sound-era silent film, a tramp falls in love with a beautiful blind flower seller.",
        "id": "tt0021749",
        "year": "1931"
    },
    {
        "rank": "12",
        "imdbId": "tt0049730",
        "checked": false,
        "favorite": false,
        "movieTitle": "The Searchers",
        "posterPath": "/jLBmgW0epNzJ1N9uzaVCjbyT94v.jpg",
        "overview": "As a Civil War veteran spends years searching for a young niece captured by Indians, his motivation becomes increasingly questionable.",
        "id": "tt0049730",
        "year": "1956"
    },
    {
        "rank": "13",
        "imdbId": "tt0076759",
        "checked": false,
        "favorite": false,
        "movieTitle": "Star Wars",
        "posterPath": "/6FfCtAuVAW8XJjZ7eWeLibRLWTw.jpg",
        "overview": "Princess Leia is captured and held hostage by the evil Imperial forces in their effort to take over the galactic Empire. Venturesome Luke Skywalker and dashing captain Han Solo team together with the loveable robot duo R2-D2 and C-3PO to rescue the beautiful princess and restore peace and justice in the Empire.",
        "id": "tt0076759",
        "year": "1977"
    },
    {
        "rank": "14",
        "imdbId": "tt0054215",
        "checked": false,
        "favorite": false,
        "movieTitle": "Psycho",
        "posterPath": "/yz4QVqPx3h1hD1DfqqQkCq3rmxW.jpg",
        "overview": "When larcenous real estate clerk Marion Crane goes on the lam with a wad of cash and hopes of starting a new life, she ends up at the notorious Bates Motel, where manager Norman Bates cares for his housebound mother.",
        "id": "tt0054215",
        "year": "1960"
    },
    {
        "rank": "15",
        "imdbId": "tt0062622",
        "checked": false,
        "favorite": false,
        "movieTitle": "2001: A Space Odyssey",
        "posterPath": "/ve72VxNqjGM69Uky4WTo2bK6rfq.jpg",
        "overview": "Humanity finds a mysterious object buried beneath the lunar surface and sets off to find its origins with the help of HAL 9000, the world's most advanced super computer.",
        "id": "tt0062622",
        "year": "1968"
    },
    {
        "rank": "16",
        "imdbId": "tt0043014",
        "checked": false,
        "favorite": false,
        "movieTitle": "Sunset Boulevard",
        "posterPath": "/sC4Dpmn87oz9AuxZ15Lmip0Ftgr.jpg",
        "overview": "A hack screenwriter writes a screenplay for a former silent film star who has faded into Hollywood obscurity.",
        "id": "tt0043014",
        "year": "1950"
    },
    {
        "rank": "17",
        "imdbId": "tt0061722",
        "checked": false,
        "favorite": false,
        "movieTitle": "The Graduate",
        "posterPath": "/AuFvrbtWSPiBPIv9ewH2DV4nhCD.jpg",
        "overview": "Benjamin, a recent college graduate very worried about his future, finds himself in a love triangle with an older woman and her daughter.",
        "id": "tt0061722",
        "year": "1967"
    },
    {
        "rank": "18",
        "imdbId": "tt0017925",
        "checked": false,
        "favorite": false,
        "movieTitle": "The General",
        "posterPath": "/iaV7LKAEialeaKDtf22SrYMqeFC.jpg",
        "overview": "During America’s Civil War, Union spies steal engineer Johnnie Gray's beloved locomotive, 'The General'—with Johnnie's lady love aboard an attached boxcar—and he single-handedly must do all in his power to both get The General back and to rescue Annabelle.",
        "id": "tt0017925",
        "year": "1926"
    },
    {
        "rank": "19",
        "imdbId": "tt0047296",
        "checked": false,
        "favorite": false,
        "movieTitle": "On the Waterfront",
        "posterPath": "/fKjLZy9W8VxMOp5OoyWojmLVCQw.jpg",
        "overview": "Terry Malloy dreams about being a prize fighter, while tending his pigeons and running errands at the docks for Johnny Friendly, the corrupt boss of the dockers union. Terry witnesses a murder by two of Johnny's thugs, and later meets the dead man's sister and feels responsible for his death. She introduces him to Father Barry, who tries to force him to provide information for the courts that will smash the dock racketeers.",
        "id": "tt0047296",
        "year": "1954"
    },
    {
        "rank": "20",
        "imdbId": "tt0038650",
        "checked": false,
        "favorite": false,
        "movieTitle": "It's a Wonderful Life",
        "posterPath": "/bSqt9rhDZx1Q7UZ86dBPKdNomp2.jpg",
        "overview": "A holiday favourite for generations...  George Bailey has spent his entire life giving to the people of Bedford Falls.  All that prevents rich skinflint Mr. Potter from taking over the entire town is George's modest building and loan company.  But on Christmas Eve the business's $8,000 is lost and George's troubles begin.",
        "id": "tt0038650",
        "year": "1946"
    },
    {
        "rank": "21",
        "imdbId": "tt0071315",
        "checked": false,
        "favorite": false,
        "movieTitle": "Chinatown",
        "posterPath": "/7ljxmU9L0ugUvyyg0GBkFaarjEq.jpg",
        "overview": "Private eye Jake Gittes lives off of the murky moral climate of sunbaked, pre-World War II Southern California. Hired by a beautiful socialite to investigate her husband's extra-marital affair, Gittes is swept into a maelstrom of double dealings and deadly deceits, uncovering a web of personal and political scandals that come crashing together.",
        "id": "tt0071315",
        "year": "1974"
    },
    {
        "rank": "22",
        "imdbId": "tt0053291",
        "checked": false,
        "favorite": false,
        "movieTitle": "Some Like It Hot",
        "posterPath": "/hVIKyTK13AvOGv7ICmJjK44DTzp.jpg",
        "overview": "Two musicians witness a mob hit and struggle to find a way out of the city before they are found by the gangsters. Their only opportunity is to join an all-girl band as they leave on a tour. To make their getaway they must first disguise themselves as women, then keep their identities secret and deal with the problems this brings - such as an attractive bandmate and a very determined suitor.",
        "id": "tt0053291",
        "year": "1959"
    },
    {
        "rank": "23",
        "imdbId": "tt0032551",
        "checked": false,
        "favorite": false,
        "movieTitle": "The Grapes of Wrath",
        "posterPath": "/eUcxMVBIA0Jg8l1RGUqycrc3eIQ.jpg",
        "overview": "Tom Joad returns to his home after a jail sentence to find his family kicked out of their farm due to foreclosure. He catches up with them on his Uncle’s farm, and joins them the next day as they head for California and a new life... Hopefully.",
        "id": "tt0032551",
        "year": "1940"
    },
    {
        "rank": "24",
        "imdbId": "tt0083866",
        "checked": false,
        "favorite": false,
        "movieTitle": "E.T. the Extra-Terrestrial",
        "posterPath": "/an0nD6uq6byfxXCfk6lQBzdL2J1.jpg",
        "overview": "After a gentle alien becomes stranded on Earth, the being is discovered and befriended by a young boy named Elliott. Bringing the extraterrestrial into his suburban California house, Elliott introduces E.T., as the alien is dubbed, to his brother and his little sister, Gertie, and the children decide to keep its existence a secret. Soon, however, E.T. falls ill, resulting in government intervention and a dire situation for both Elliott and the alien.",
        "id": "tt0083866",
        "year": "1982"
    },
    {
        "rank": "25",
        "imdbId": "tt0056592",
        "checked": false,
        "favorite": false,
        "movieTitle": "To Kill a Mockingbird",
        "posterPath": "/o5icF9TCe8Ld5bWy19rPwsNyLLv.jpg",
        "overview": "Scout Finch, 6, and her older brother Jem live in sleepy Maycomb, Alabama, spending much of their time with their friend Dill and spying on their reclusive and mysterious neighbor, Boo Radley. When Atticus, their widowed father and a respected lawyer, defends a black man named Tom Robinson against fabricated rape charges, the trial and tangent events expose the children to evils of racism and stereotyping.",
        "id": "tt0056592",
        "year": "1962"
    },
    {
        "rank": "26",
        "imdbId": "tt0031679",
        "checked": false,
        "favorite": false,
        "movieTitle": "Mr. Smith Goes to Washington",
        "posterPath": "/nDjg1fbNyq15excNDl3acd2IqAk.jpg",
        "overview": "Naive and idealistic Jefferson Smith, leader of the Boy Rangers, is appointed to the United States Senate by the puppet governor of his state. He soon discovers, upon going to Washington, many shortcomings of the political process as his earnest goal of a national boys' camp leads to a conflict with the state political boss.",
        "id": "tt0031679",
        "year": "1939"
    },
    {
        "rank": "27",
        "imdbId": "tt0044706",
        "checked": false,
        "favorite": false,
        "movieTitle": "High Noon",
        "posterPath": "/bc1x6kIO9oF30y3IMFuKMJV2uOj.jpg",
        "overview": "Will Kane, the sheriff of a small town in New Mexico, learns a notorious outlaw he put in jail has been freed, and will be arriving on the noon train. Knowing the outlaw and his gang are coming to kill him, Kane is determined to stand his ground, so he attempts to gather a posse from among the local townspeople.",
        "id": "tt0044706",
        "year": "1952"
    },
    {
        "rank": "28",
        "imdbId": "tt0042192",
        "checked": false,
        "favorite": false,
        "movieTitle": "All About Eve",
        "posterPath": "/6numIZH6uR3NlJgY9m7nGH0jhs.jpg",
        "overview": "From the moment she glimpses her idol at the stage door, Eve Harrington is determined to take the reins of power away from the great actress Margo Channing. Eve maneuvers her way into Margo's Broadway role, becomes a sensation and even causes turmoil in the lives of Margo's director boyfriend, her playwright and his wife. Only the cynical drama critic sees through Eve, admiring her audacity and perfect pattern of deceit.",
        "id": "tt0042192",
        "year": "1950"
    },
    {
        "rank": "29",
        "imdbId": "tt0036775",
        "checked": false,
        "favorite": false,
        "movieTitle": "Double Indemnity",
        "posterPath": "/kkfKLeOTo7RjS9TxHKpknlL7huS.jpg",
        "overview": "A rich woman and a calculating insurance agent plot to kill her unsuspecting husband after he signs a double indemnity policy. Against a backdrop of distinctly Californian settings, the partners in crime plan the perfect murder to collect the insurance, which pays double if the death is accidental.",
        "id": "tt0036775",
        "year": "1944"
    },
    {
        "rank": "30",
        "imdbId": "tt0078788",
        "checked": false,
        "favorite": false,
        "movieTitle": "Apocalypse Now",
        "posterPath": "/gQB8Y5RCMkv2zwzFHbUJX3kAhvA.jpg",
        "overview": "At the height of the Vietnam war, Captain Benjamin Willard is sent on a dangerous mission that, officially, \"does not exist, nor will it ever exist.\" His goal is to locate - and eliminate - a mysterious Green Beret Colonel named Walter Kurtz, who has been leading his personal army on illegal guerrilla missions into enemy territory.",
        "id": "tt0078788",
        "year": "1979"
    },
    {
        "rank": "31",
        "imdbId": "tt0033870",
        "checked": false,
        "favorite": false,
        "movieTitle": "The Maltese Falcon",
        "posterPath": "/wcGLnRsuKyCYg3WLXQqIuB0lsJB.jpg",
        "overview": "A private detective takes on a case that involves him with three eccentric criminals, a beautiful liar, and their quest for a priceless statuette.",
        "id": "tt0033870",
        "year": "1941"
    },
    {
        "rank": "32",
        "imdbId": "tt0071562",
        "checked": false,
        "favorite": false,
        "movieTitle": "The Godfather Part II",
        "posterPath": "/hek3koDUyRQk7FIhPXsa6mT2Zc3.jpg",
        "overview": "In the continuing saga of the Corleone crime family, a young Vito Corleone grows up in Sicily and in 1910s New York. In the 1950s, Michael Corleone attempts to expand the family business into Las Vegas, Hollywood and Cuba.",
        "id": "tt0071562",
        "year": "1974"
    },
    {
        "rank": "33",
        "imdbId": "tt0073486",
        "checked": false,
        "favorite": false,
        "movieTitle": "One Flew Over the Cuckoo's Nest",
        "posterPath": "/3jcbDmRFiQ83drXNOvRDeKHxS0C.jpg",
        "overview": "A petty criminal fakes insanity to serve his sentence in a mental ward rather than prison. He soon finds himself as a leader to the other patients—and an enemy to the cruel, domineering nurse who runs the ward.",
        "id": "tt0073486",
        "year": "1975"
    },
    {
        "rank": "34",
        "imdbId": "tt0029583",
        "checked": false,
        "favorite": false,
        "movieTitle": "Snow White and the Seven Dwarfs",
        "posterPath": "/9QKUh9UuIIT2ZA9Rby9R6vtNRKa.jpg",
        "overview": "A beautiful girl, Snow White, takes refuge in the forest in the house of seven dwarfs to hide from her stepmother, the wicked Queen. The Queen is jealous because she wants to be known as \"the fairest in the land,\" and Snow White's beauty surpasses her own.",
        "id": "tt0029583",
        "year": "1937"
    },
    {
        "rank": "35",
        "imdbId": "tt0075686",
        "checked": false,
        "favorite": false,
        "movieTitle": "Annie Hall",
        "posterPath": "/gBo4G0p8iVS998aYvXS656jbsH2.jpg",
        "overview": "New York comedian Alvy Singer falls in love with the ditsy Annie Hall.",
        "id": "tt0075686",
        "year": "1977"
    },
    {
        "rank": "36",
        "imdbId": "tt0050212",
        "checked": false,
        "favorite": false,
        "movieTitle": "The Bridge on the River Kwai",
        "posterPath": "/7paXMt2e3Tr5dLmEZOGgFEn2Vo7.jpg",
        "overview": "The classic story of English POWs in Burma forced to build a bridge to aid the war effort of their Japanese captors. British and American intelligence officers conspire to blow up the structure, but Col. Nicholson , the commander who supervised the bridge's construction, has acquired a sense of pride in his creation and tries to foil their plans.",
        "id": "tt0050212",
        "year": "1957"
    },
    {
        "rank": "37",
        "imdbId": "tt0036868",
        "checked": false,
        "favorite": false,
        "movieTitle": "The Best Years of Our Lives",
        "posterPath": "/gd5EoAU4MM57sW3vlWxJ0NMM8cV.jpg",
        "overview": "It's the hope that sustains the spirit of every GI: the dream of the day when he will finally return home. For three WWII veterans, the day has arrived. But for each man, the dream is about to become a nightmare.",
        "id": "tt0036868",
        "year": "1946"
    },
    {
        "rank": "38",
        "imdbId": "tt0040897",
        "checked": false,
        "favorite": false,
        "movieTitle": "The Treasure of the Sierra Madre",
        "posterPath": "/pWcst7zVbi8Z8W6GFrdNE7HHRxL.jpg",
        "overview": "Fred C. Dobbs and Bob Curtin, both down on their luck in Tampico, Mexico in 1925, meet up with a grizzled prospector named Howard and decide to join with him in search of gold in the wilds of central Mexico. Through enormous difficulties, they eventually succeed in finding gold, but bandits, the elements, and most especially greed threaten to turn their success into disaster.",
        "id": "tt0040897",
        "year": "1948"
    },
    {
        "rank": "39",
        "imdbId": "tt0057012",
        "checked": false,
        "favorite": false,
        "movieTitle": "Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb",
        "posterPath": "/gHm96BRW4GoI339rF1vYoYTB6Qe.jpg",
        "overview": "After the insane General Jack D. Ripper initiates a nuclear strike on the Soviet Union, a war room full of politicians, generals and a Russian diplomat all frantically try to stop the nuclear strike.",
        "id": "tt0057012",
        "year": "1964"
    },
    {
        "rank": "40",
        "imdbId": "tt0059742",
        "checked": false,
        "favorite": false,
        "movieTitle": "The Sound of Music",
        "posterPath": "/xvXiJggaxRrU4jLjTXCmqnqEsGd.jpg",
        "overview": "In the years before the Second World War, a tomboyish postulant at an Austrian abbey becomes a governess in the home of a widowed naval captain with seven children, and brings a new love of life and music into the home.",
        "id": "tt0059742",
        "year": "1965"
    },
    {
        "rank": "41",
        "imdbId": "tt0024216",
        "checked": false,
        "favorite": false,
        "movieTitle": "King Kong",
        "posterPath": "/lHlnxKL5GbgRibyRFI7n1Ey850i.jpg",
        "overview": "Adventurous filmmaker, Carl Denham, sets out to produce a motion picture unlike anything the world has seen before. Alongside his leading lady Ann Darrow and his first mate Jack Driscoll, they arrive on an island and discover a legendary creature said to be neither beast nor man. Denham captures the monster to displayed on Broadway as Kong, the eighth wonder of the world.",
        "id": "tt0024216",
        "year": "1933"
    },
    {
        "rank": "42",
        "imdbId": "tt0061418",
        "checked": false,
        "favorite": false,
        "movieTitle": "Bonnie and Clyde",
        "posterPath": "/sCSQFK9kMsprT4jgWqgw82dT6WI.jpg",
        "overview": "In the 1930s, bored waitress Bonnie Parker falls in love with an ex-con named Clyde Barrow and together they start a violent crime spree through the country, stealing cars and robbing banks.",
        "id": "tt0061418",
        "year": "1967"
    },
    {
        "rank": "43",
        "imdbId": "tt0064665",
        "checked": false,
        "favorite": false,
        "movieTitle": "Midnight Cowboy",
        "posterPath": "/f7YLzOxwWzeEdo7RhAlPSBTYa8.jpg",
        "overview": "Joe Buck is a wide-eyed hustler from Texas hoping to score big with wealthy New York City women; he finds a companion in Enrico \"Ratso\" Rizzo, an ailing swindler with a bum leg and a quixotic fantasy of escaping to Florida.",
        "id": "tt0064665",
        "year": "1969"
    },
    {
        "rank": "44",
        "imdbId": "tt0032904",
        "checked": false,
        "favorite": false,
        "movieTitle": "The Philadelphia Story",
        "posterPath": "/dKUubjvxO78XDts6VP1Ggcp4R9O.jpg",
        "overview": "When a rich woman's ex-husband and a tabloid-type reporter turn up just before her planned remarriage, she begins to learn the truth about herself.",
        "id": "tt0032904",
        "year": "1940"
    },
    {
        "rank": "45",
        "imdbId": "tt0046303",
        "checked": false,
        "favorite": false,
        "movieTitle": "Shane",
        "posterPath": "/svr5ADpjXTCOQv8hmuJnB7I14Qv.jpg",
        "overview": "A weary gunfighter attempts to settle down with a homestead family, but a smouldering settler and rancher conflict forces him to act.",
        "id": "tt0046303",
        "year": "1953"
    },
    {
        "rank": "46",
        "imdbId": "tt0025316",
        "checked": false,
        "favorite": false,
        "movieTitle": "It Happened One Night",
        "posterPath": "/2PNUGWAflH6UUumas0POMmokHlc.jpg",
        "overview": "A renegade reporter and a crazy young heiress meet on a bus heading for New York, and end up stuck with each other when the bus leaves them behind at one of the stops.",
        "id": "tt0025316",
        "year": "1934"
    },
    {
        "rank": "47",
        "imdbId": "tt0044081",
        "checked": false,
        "favorite": false,
        "movieTitle": "A Streetcar Named Desire",
        "posterPath": "/aicdlO5vt7z2ARm279eGzJeYCLQ.jpg",
        "overview": "A fading southern belle tries to build a new life with her sister in New Orleans.",
        "id": "tt0044081",
        "year": "1951"
    },
    {
        "rank": "48",
        "imdbId": "tt0047396",
        "checked": false,
        "favorite": false,
        "movieTitle": "Rear Window",
        "posterPath": "/qitnZcLP7C9DLRuPpmvZ7GiEjJN.jpg",
        "overview": "A wheelchair-bound photographer spies on his neighbors from his apartment window and becomes convinced one of them has committed murder.",
        "id": "tt0047396",
        "year": "1954"
    },
    {
        "rank": "49",
        "imdbId": "tt0006864",
        "checked": false,
        "favorite": false,
        "movieTitle": "Intolerance: Love's Struggle Throughout the Ages",
        "posterPath": "/lJCabs4TMOsKfnl0BmA5Hf16Ezb.jpg",
        "overview": "The story of a poor young woman, separated by prejudice from her husband and baby, is interwoven with tales of intolerance from throughout history.",
        "id": "tt0006864",
        "year": "1916"
    },
    {
        "rank": "50",
        "imdbId": "tt0120737",
        "checked": false,
        "favorite": false,
        "movieTitle": "The Lord of the Rings: The Fellowship of the Ring",
        "posterPath": "/6oom5QYQ2yQTMJIbnvbkBL9cHo6.jpg",
        "overview": "Young hobbit Frodo Baggins, after inheriting a mysterious ring from his uncle Bilbo, must leave his home in order to keep it from falling into the hands of its evil creator. Along the way, a fellowship is formed to protect the ringbearer and make sure that the ring arrives at its final destination: Mt. Doom, the only place where it can be destroyed.",
        "id": "tt0120737",
        "year": "2001"
    },
    {
        "rank": "51",
        "imdbId": "tt0055614",
        "checked": false,
        "favorite": false,
        "movieTitle": "West Side Story",
        "posterPath": "/nzCMu6D5q60i2bVrIQ0DxlRSgCZ.jpg",
        "overview": "In the slums of the upper West Side of Manhattan, New York, a gang of Polish-American teenagers called the Jets compete with a rival gang of recently immigrated Puerto Ricans, the Sharks, to \"own\" the neighborhood streets. Tensions are high between the gangs but two kids, one from each rival gang, fall in love leading to tragedy.",
        "id": "tt0055614",
        "year": "1961"
    },
    {
        "rank": "52",
        "imdbId": "tt0075314",
        "checked": false,
        "favorite": false,
        "movieTitle": "Taxi Driver",
        "posterPath": "/ekstpH614fwDX8DUln1a2Opz0N8.jpg",
        "overview": "A mentally unstable Vietnam War veteran works as a night-time taxi driver in New York City where the perceived decadence and sleaze feed his urge for violent action.",
        "id": "tt0075314",
        "year": "1976"
    },
    {
        "rank": "53",
        "imdbId": "tt0077416",
        "checked": false,
        "favorite": false,
        "movieTitle": "The Deer Hunter",
        "posterPath": "/bbGtogDZOg09bm42KIpCXUXICkh.jpg",
        "overview": "A group of working-class friends decide to enlist in the Army during the Vietnam War and finds it to be hellish chaos -- not the noble venture they imagined. Before they left, Steven married his pregnant girlfriend -- and Michael and Nick were in love with the same woman. But all three are different men upon their return.",
        "id": "tt0077416",
        "year": "1978"
    },
    {
        "rank": "54",
        "imdbId": "tt0066026",
        "checked": false,
        "favorite": false,
        "movieTitle": "M*A*S*H",
        "posterPath": "/xZHNAcCVd5gUy68MBc4CmDqmely.jpg",
        "overview": "The staff of a Korean War field hospital use humor and hijinks to keep their sanity in the face of the horror of war.",
        "id": "tt0066026",
        "year": "1970"
    },
    {
        "rank": "55",
        "imdbId": "tt0053125",
        "checked": false,
        "favorite": false,
        "movieTitle": "North by Northwest",
        "posterPath": "/8gvfRlVpcKaTVqipXpYOGWBN1aO.jpg",
        "overview": "Advertising man Roger Thornhill is mistaken for a spy, triggering a deadly cross-country chase.",
        "id": "tt0053125",
        "year": "1959"
    },
    {
        "rank": "56",
        "imdbId": "tt0073195",
        "checked": false,
        "favorite": false,
        "movieTitle": "Jaws",
        "posterPath": "/lxM6kqilAdpdhqUl2biYp5frUxE.jpg",
        "overview": "When an insatiable great white shark terrorizes the townspeople of Amity Island, the police chief, an oceanographer and a grizzled shark hunter seek to destroy the blood-thirsty beast.",
        "id": "tt0073195",
        "year": "1975"
    },
    {
        "rank": "57",
        "imdbId": "tt0075148",
        "checked": false,
        "favorite": false,
        "movieTitle": "Rocky",
        "posterPath": "/hEjK9A9BkNXejFW4tfacVAEHtkn.jpg",
        "overview": "When world heavyweight boxing champion, Apollo Creed wants to give an unknown fighter a shot at the title as a publicity stunt, his handlers choose palooka Rocky Balboa, an uneducated collector for a Philadelphia loan shark. Rocky teams up with trainer  Mickey Goldmill to make the most of this once in a lifetime break.",
        "id": "tt0075148",
        "year": "1976"
    },
    {
        "rank": "58",
        "imdbId": "tt0015864",
        "checked": false,
        "favorite": false,
        "movieTitle": "The Gold Rush",
        "posterPath": "/eQRFo1qwRREYwj47Yoe1PisgOle.jpg",
        "overview": "A lone prospector ventures into Alaska looking for gold. He soon gets mixed up with some burly characters, falls in love with the beautiful Georgia, and tries to win her heart with his singular charm.",
        "id": "tt0015864",
        "year": "1925"
    },
    {
        "rank": "59",
        "imdbId": "tt0073440",
        "checked": false,
        "favorite": false,
        "movieTitle": "Nashville",
        "posterPath": "/AoJaGGu8pp7jfhpg60poef5DzsJ.jpg",
        "overview": "The intersecting stories of twenty-four characters—from country star to wannabe to reporter to waitress—connect to the music business in Nashville, Tennessee.",
        "id": "tt0073440",
        "year": "1975"
    },
    {
        "rank": "60",
        "imdbId": "tt0023969",
        "checked": false,
        "favorite": false,
        "movieTitle": "Duck Soup",
        "posterPath": "/31t63plEGKHhYuuCpC9bFWO9SBS.jpg",
        "overview": "Rufus T. Firefly is named president/dictator of bankrupt Freedonia and declares war on neighboring Sylvania over the love of wealthy Mrs. Teasdale.",
        "id": "tt0023969",
        "year": "1933"
    },
    {
        "rank": "61",
        "imdbId": "tt0034240",
        "checked": false,
        "favorite": false,
        "movieTitle": "Sullivan's Travels",
        "posterPath": "/z5cqIM0ysVjkCmaDfyTQnlozdIp.jpg",
        "overview": "Successful movie director John L. Sullivan, convinced he won't be able to film his ambitious masterpiece until he has suffered, dons a hobo disguise and sets off on a journey, aiming to \"know trouble\" first-hand. When all he finds is a train ride back to Hollywood and a beautiful blonde companion, he redoubles his efforts, managing to land himself in more trouble than he bargained for when he loses his memory and ends up a prisoner on a chain gang.",
        "id": "tt0034240",
        "year": "1941"
    },
    {
        "rank": "62",
        "imdbId": "tt0069704",
        "checked": false,
        "favorite": false,
        "movieTitle": "American Graffiti",
        "posterPath": "/1yFdtOV0b9UBUoBNbw0ZcyLbadk.jpg",
        "overview": "A couple of high school graduates spend one final night cruising the strip with their buddies before they go off to college.",
        "id": "tt0069704",
        "year": "1973"
    },
    {
        "rank": "63",
        "imdbId": "tt0068327",
        "checked": false,
        "favorite": false,
        "movieTitle": "Cabaret",
        "posterPath": "/fMhOeJ2TvuY46iYGmsowhgRXfnr.jpg",
        "overview": "Inside the Kit Kat Club of 1931 Berlin, starry-eyed singer Sally Bowles and an impish emcee sound the clarion call to decadent fun, while outside a certain political party grows into a brutal force.",
        "id": "tt0068327",
        "year": "1972"
    },
    {
        "rank": "64",
        "imdbId": "tt0074958",
        "checked": false,
        "favorite": false,
        "movieTitle": "Network",
        "posterPath": "/uFmgWfiykZhStfs1B13fFdUO1Pk.jpg",
        "overview": "When veteran anchorman Howard Beale is forced to retire his 25-year post because of his age, he announces to viewers that he will kill himself during his farewell broadcast. Network executives rethink their decision when his fanatical tirade results in a spike in ratings.",
        "id": "tt0074958",
        "year": "1976"
    },
    {
        "rank": "65",
        "imdbId": "tt0043265",
        "checked": false,
        "favorite": false,
        "movieTitle": "The African Queen",
        "posterPath": "/2Ypg0KhQfFYWILelvHGtSHHR0dk.jpg",
        "overview": "At the start of the First World War, in the middle of Africa’s nowhere, a gin soaked riverboat captain is persuaded by a strong-willed missionary to go down river and face-off a German warship.",
        "id": "tt0043265",
        "year": "1952"
    },
    {
        "rank": "66",
        "imdbId": "tt0082971",
        "checked": false,
        "favorite": false,
        "movieTitle": "Raiders of the Lost Ark",
        "posterPath": "/ceG9VzoRAVGwivFU403Wc3AHRys.jpg",
        "overview": "When Dr. Indiana Jones – the tweed-suited professor who just happens to be a celebrated archaeologist – is hired by the government to locate the legendary Ark of the Covenant, he finds himself up against the entire Nazi regime.",
        "id": "tt0082971",
        "year": "1981"
    },
    {
        "rank": "67",
        "imdbId": "tt0061184",
        "checked": false,
        "favorite": false,
        "movieTitle": "Who's Afraid of Virginia Woolf?",
        "posterPath": "/wF7ihB5V5gSm6zxjv3ZhHOpgREI.jpg",
        "overview": "A history professor and his wife entertain a young couple who are new to the university's faculty. As the drinks flow, secrets come to light, and the middle-aged couple unload onto their guests the full force of the bitterness, dysfunction, and animosity that defines their marriage.",
        "id": "tt0061184",
        "year": "1966"
    },
    {
        "rank": "68",
        "imdbId": "tt0105695",
        "checked": false,
        "favorite": false,
        "movieTitle": "Unforgiven",
        "posterPath": "/yKyLJmRAtyXEEYKOvPhKHXIcPq9.jpg",
        "overview": "William Munny is a retired, once-ruthless killer turned gentle widower and hog farmer. To help support his two motherless children, he accepts one last bounty-hunter mission to find the men who brutalized a prostitute. Joined by his former partner and a cocky greenhorn, he takes on a corrupt sheriff.",
        "id": "tt0105695",
        "year": "1992"
    },
    {
        "rank": "69",
        "imdbId": "tt0084805",
        "checked": false,
        "favorite": false,
        "movieTitle": "Tootsie",
        "posterPath": "/x9cBsqf64j8e5a8PwThT3I6sHFK.jpg",
        "overview": "When struggling, out of work actor Michael Dorsey secretly adopts a female alter ego - Dorothy Michaels - in order to land a part in a daytime drama, he unwittingly becomes a feminist icon and ends up in a romantic pickle.",
        "id": "tt0084805",
        "year": "1982"
    },
    {
        "rank": "70",
        "imdbId": "tt0066921",
        "checked": false,
        "favorite": false,
        "movieTitle": "A Clockwork Orange",
        "posterPath": "/4sHeTAp65WrSSuc05nRBKddhBxO.jpg",
        "overview": "In a near-future Britain, young Alexander DeLarge and his pals get their kicks beating and raping anyone they please. When not destroying the lives of others, Alex swoons to the music of Beethoven. The state, eager to crack down on juvenile crime, gives an incarcerated Alex the option to undergo an invasive procedure that'll rob him of all personal agency. In a time when conscience is a commodity, can Alex change his tune?",
        "id": "tt0066921",
        "year": "1971"
    },
    {
        "rank": "71",
        "imdbId": "tt0120815",
        "checked": false,
        "favorite": false,
        "movieTitle": "Saving Private Ryan",
        "posterPath": "/1wY4psJ5NVEhCuOYROwLH2XExM2.jpg",
        "overview": "As U.S. troops storm the beaches of Normandy, three brothers lie dead on the battlefield, with a fourth trapped behind enemy lines. Ranger captain John Miller and seven men are tasked with penetrating German-held territory and bringing the boy home.",
        "id": "tt0120815",
        "year": "1998"
    },
    {
        "rank": "72",
        "imdbId": "tt0111161",
        "checked": false,
        "favorite": false,
        "movieTitle": "The Shawshank Redemption",
        "posterPath": "/q6y0Go1tsGEsmtFryDOJo3dEmqu.jpg",
        "overview": "Framed in the 1940s for the double murder of his wife and her lover, upstanding banker Andy Dufresne begins a new life at the Shawshank prison, where he puts his accounting skills to work for an amoral warden. During his long stretch in prison, Dufresne comes to be admired by the other inmates -- including an older prisoner named Red -- for his integrity and unquenchable sense of hope.",
        "id": "tt0111161",
        "year": "1994"
    },
    {
        "rank": "73",
        "imdbId": "tt0064115",
        "checked": false,
        "favorite": false,
        "movieTitle": "Butch Cassidy and the Sundance Kid",
        "posterPath": "/gFmmykF1Ym3OGzENo50nZQaD1dx.jpg",
        "overview": "In late 1890s Wyoming, Butch Cassidy is the affable, clever and talkative leader of the outlaw Hole in the Wall Gang. His closest companion is the laconic dead-shot Sundance Kid. As the west rapidly becomes civilized, the law finally catches up to Butch, Sundance and their gang.  Chased doggedly by a special posse, the two decide to make their way to South America in hopes of evading their pursuers once and for all.",
        "id": "tt0064115",
        "year": "1969"
    },
    {
        "rank": "74",
        "imdbId": "tt0102926",
        "checked": false,
        "favorite": false,
        "movieTitle": "The Silence of the Lambs",
        "posterPath": "/rplLJ2hPcOQmkFhTqUte0MkEaO2.jpg",
        "overview": "Clarice Starling is a top student at the FBI's training academy. Jack Crawford wants Clarice to interview Dr. Hannibal Lecter, a brilliant psychiatrist who is also a violent psychopath, serving life behind bars for various acts of murder and cannibalism. Crawford believes that Lecter may have insight into a case and that Starling, as an attractive young woman, may be just the bait to draw him out.",
        "id": "tt0102926",
        "year": "1991"
    },
    {
        "rank": "75",
        "imdbId": "tt0061811",
        "checked": false,
        "favorite": false,
        "movieTitle": "In the Heat of the Night",
        "posterPath": "/fvqHTabYej3LwzKRRZCm6jV3g0O.jpg",
        "overview": "African-American Philadelphia police detective Virgil Tibbs is arrested on suspicion of murder by Bill Gillespie, the racist police chief of tiny Sparta, Mississippi. After Tibbs proves not only his own innocence but that of another man, he joins forces with Gillespie to track down the real killer. Their investigation takes them through every social level of the town, with Tibbs making enemies as well as unlikely friends as he hunts for the truth.",
        "id": "tt0061811",
        "year": "1967"
    },
    {
        "rank": "76",
        "imdbId": "tt0109830",
        "checked": false,
        "favorite": false,
        "movieTitle": "Forrest Gump",
        "posterPath": "/saHP97rTPS5eLmrLQEcANmKrsFl.jpg",
        "overview": "A man with a low IQ has accomplished great things in his life and been present during significant historic events—in each case, far exceeding what anyone imagined he could do. But despite all he has achieved, his one true love eludes him.",
        "id": "tt0109830",
        "year": "1994"
    },
    {
        "rank": "77",
        "imdbId": "tt0074119",
        "checked": false,
        "favorite": false,
        "movieTitle": "All the President's Men",
        "posterPath": "/cPtSHR7D2WGsDBfnC5DxV927hKn.jpg",
        "overview": "During the 1972 elections, two reporters' investigation sheds light on the controversial Watergate scandal that compels President Nixon to resign from his post.",
        "id": "tt0074119",
        "year": "1976"
    },
    {
        "rank": "78",
        "imdbId": "tt0027977",
        "checked": false,
        "favorite": false,
        "movieTitle": "Modern Times",
        "posterPath": "/9xeglIbChLIe0P4fTQNAdlG2v0C.jpg",
        "overview": "The Tramp struggles to live in modern industrial society with the help of a young homeless woman.",
        "id": "tt0027977",
        "year": "1936"
    },
    {
        "rank": "79",
        "imdbId": "tt0065214",
        "checked": false,
        "favorite": false,
        "movieTitle": "The Wild Bunch",
        "posterPath": "/zZhp7p8qvfVrSLKpOFHcKjpEj8f.jpg",
        "overview": "An aging group of outlaws look for one last big score as the \"traditional\" American West is disappearing around them.",
        "id": "tt0065214",
        "year": "1969"
    },
    {
        "rank": "80",
        "imdbId": "tt0053604",
        "checked": false,
        "favorite": false,
        "movieTitle": "The Apartment",
        "posterPath": "/jCgbZGYQ4PcfUBiI4679Vjz3H81.jpg",
        "overview": "Bud Baxter is a minor clerk in a huge New York insurance company, until he discovers a quick way to climb the corporate ladder. He lends out his apartment to the executives as a place to take their mistresses. Although he often has to deal with the aftermath of their visits, one night he's left with a major problem to solve.",
        "id": "tt0053604",
        "year": "1960"
    },
    {
        "rank": "81",
        "imdbId": "tt0054331",
        "checked": false,
        "favorite": false,
        "movieTitle": "Spartacus",
        "posterPath": "/prdCmV8GkDLpguwoxBQczFAwvci.jpg",
        "overview": "The rebellious Thracian Spartacus, born and raised a slave, is sold to Gladiator trainer Batiatus. After weeks of being trained to kill for the arena, Spartacus turns on his owners and leads the other slaves in rebellion. As the rebels move from town to town, their numbers swell as escaped slaves join their ranks. Under the leadership of Spartacus, they make their way to southern Italy, where they will cross the sea and return to their homes.",
        "id": "tt0054331",
        "year": "1960"
    },
    {
        "rank": "82",
        "imdbId": "tt0018455",
        "checked": false,
        "favorite": false,
        "movieTitle": "Sunrise: A Song of Two Humans",
        "posterPath": "/oj8ZW8jKXBSs8F1e5iWsTUeXSJW.jpg",
        "overview": "A married farmer falls under the spell of a slatternly woman from the city, who tries to convince him to drown his wife.",
        "id": "tt0018455",
        "year": "1927"
    },
    {
        "rank": "83",
        "imdbId": "tt0120338",
        "checked": false,
        "favorite": false,
        "movieTitle": "Titanic",
        "posterPath": "/9xjZS2rlVxm8SFx8kPC3aIGCOYQ.jpg",
        "overview": "101-year-old Rose DeWitt Bukater tells the story of her life aboard the Titanic, 84 years later. A young Rose boards the ship with her mother and fiancé. Meanwhile, Jack Dawson and Fabrizio De Rossi win third-class tickets aboard the ship. Rose tells the whole story from Titanic's departure through to its death—on its first and last voyage—on April 15, 1912.",
        "id": "tt0120338",
        "year": "1997"
    },
    {
        "rank": "84",
        "imdbId": "tt0064276",
        "checked": false,
        "favorite": false,
        "movieTitle": "Easy Rider",
        "posterPath": "/mmGEB6ly9OG8SYVfvAoa6QqHNvN.jpg",
        "overview": "A cross-country trip to sell drugs puts two hippie bikers on a collision course with small-town prejudices.",
        "id": "tt0064276",
        "year": "1969"
    },
    {
        "rank": "85",
        "imdbId": "tt0026778",
        "checked": false,
        "favorite": false,
        "movieTitle": "A Night at the Opera",
        "posterPath": "/A4YDGfJwaG7aMxDVrVJsOHJ7ufK.jpg",
        "overview": "The Marx Brothers take on high society and the opera world to bring two lovers together. A sly business manager and two wacky friends of two opera singers help them achieve success while humiliating their stuffy and snobbish enemies.",
        "id": "tt0026778",
        "year": "1935"
    },
    {
        "rank": "86",
        "imdbId": "tt0091763",
        "checked": false,
        "favorite": false,
        "movieTitle": "Platoon",
        "posterPath": "/m3mmFkPQKvPZq5exmh0bDuXlD9T.jpg",
        "overview": "As a young and naive recruit in Vietnam, Chris Taylor faces a moral crisis when confronted with the horrors of war and the duality of man.",
        "id": "tt0091763",
        "year": "1986"
    },
    {
        "rank": "87",
        "imdbId": "tt0050083",
        "checked": false,
        "favorite": false,
        "movieTitle": "12 Angry Men",
        "posterPath": "/ppd84D2i9W8jXmsyInGyihiSyqz.jpg",
        "overview": "The defense and the prosecution have rested and the jury is filing into the jury room to decide if a young Spanish-American is guilty or innocent of murdering his father. What begins as an open and shut case soon becomes a mini-drama of each of the jurors' prejudices and preconceptions about the trial, the accused, and each other.",
        "id": "tt0050083",
        "year": "1957"
    },
    {
        "rank": "88",
        "imdbId": "tt0029947",
        "checked": false,
        "favorite": false,
        "movieTitle": "Bringing Up Baby",
        "posterPath": "/vTNNOtemaYmtx3k2NpsLMRJKEwZ.jpg",
        "overview": "David Huxley is waiting to get a bone he needs for his museum collection. Through a series of strange circumstances, he meets Susan Vance, and the duo have a series of misadventures which include a leopard called Baby.",
        "id": "tt0029947",
        "year": "1938"
    },
    {
        "rank": "89",
        "imdbId": "tt0167404",
        "checked": false,
        "favorite": false,
        "movieTitle": "The Sixth Sense",
        "posterPath": "/4AfSDjjCy6T5LA1TMz0Lh2HlpRh.jpg",
        "overview": "Following an unexpected tragedy, a child psychologist named Malcolm Crowe meets an nine year old boy named Cole Sear, who is hiding a dark secret.",
        "id": "tt0167404",
        "year": "1999"
    },
    {
        "rank": "90",
        "imdbId": "tt0028333",
        "checked": false,
        "favorite": false,
        "movieTitle": "Swing Time",
        "posterPath": "/crRjfw1hIW11K6yW9OXZKV8oZXw.jpg",
        "overview": "Lucky is tricked into missing his own wedding again and has to make $25,000 so her father allows him to marry Margaret. He and business partner Pop go to New York where they run into dancing instructor Penny. She and Lucky form a successful dance partnership, but romance is blighted by his old attachment to Margaret and hers for Ricky Romero.",
        "id": "tt0028333",
        "year": "1936"
    },
    {
        "rank": "91",
        "imdbId": "tt0084707",
        "checked": false,
        "favorite": false,
        "movieTitle": "Sophie's Choice",
        "posterPath": "/6zayvLCWvF8ImK5UqwRUbETcpVU.jpg",
        "overview": "Stingo, a young writer, moves to Brooklyn in 1947 to begin work on his first novel. As he becomes friendly with Sophie and her lover Nathan, he learns that she is a Holocaust survivor. Flashbacks reveal her harrowing story, from pre-war prosperity to Auschwitz. In the present, Sophie and Nathan's relationship increasingly unravels as Stingo grows closer to Sophie and Nathan's fragile mental state becomes ever more apparent.",
        "id": "tt0084707",
        "year": "1982"
    },
    {
        "rank": "92",
        "imdbId": "tt0099685",
        "checked": false,
        "favorite": false,
        "movieTitle": "GoodFellas",
        "posterPath": "/aKuFiU82s5ISJpGZp7YkIr3kCUd.jpg",
        "overview": "The true story of Henry Hill, a half-Irish, half-Sicilian Brooklyn kid who is adopted by neighbourhood gangsters at an early age and climbs the ranks of a Mafia family under the guidance of Jimmy Conway.",
        "id": "tt0099685",
        "year": "1990"
    },
    {
        "rank": "93",
        "imdbId": "tt0067116",
        "checked": false,
        "favorite": false,
        "movieTitle": "The French Connection",
        "posterPath": "/5XSGvIKl2yPvOkieFjc3rzLw7x0.jpg",
        "overview": "Tough narcotics detective 'Popeye' Doyle is in hot pursuit of a suave French drug dealer who may be the key to a huge heroin-smuggling operation.",
        "id": "tt0067116",
        "year": "1971"
    },
    {
        "rank": "94",
        "imdbId": "tt0110912",
        "checked": false,
        "favorite": false,
        "movieTitle": "Pulp Fiction",
        "posterPath": "/fIE3lAGcZDV1G6XM5KmuWnNsPp1.jpg",
        "overview": "A burger-loving hit man, his philosophical partner, a drug-addled gangster's moll and a washed-up boxer converge in this sprawling, comedic crime caper. Their adventures unfurl in three stories that ingeniously trip back and forth in time.",
        "id": "tt0110912",
        "year": "1994"
    },
    {
        "rank": "95",
        "imdbId": "tt0067328",
        "checked": false,
        "favorite": false,
        "movieTitle": "The Last Picture Show",
        "posterPath": "/7NYePZc0lZrRomtmQsjOJMePTEb.jpg",
        "overview": "High school seniors and best friends, Sonny and Duane, live in a dying Texas town. The handsome Duane is dating a local beauty, while Sonny is having an affair with the coach's wife. As graduation nears and both boys contemplate their futures, Duane eyes the army and Sonny takes over a local business. Each struggles to figure out if he can escape this dead-end town and build a better life somewhere else.",
        "id": "tt0067328",
        "year": "1971"
    },
    {
        "rank": "96",
        "imdbId": "tt0097216",
        "checked": false,
        "favorite": false,
        "movieTitle": "Do the Right Thing",
        "posterPath": "/63rmSDPahrH7C1gEFYzRuIBAN9W.jpg",
        "overview": "Salvatore \"Sal\" Fragione is the Italian owner of a pizzeria in Brooklyn. A neighborhood local, Buggin' Out, becomes upset when he sees that the pizzeria's Wall of Fame exhibits only Italian actors. Buggin' Out believes a pizzeria in a black neighborhood should showcase black actors, but Sal disagrees. The wall becomes a symbol of racism and hate to Buggin' Out and to other people in the neighborhood, and tensions rise.",
        "id": "tt0097216",
        "year": "1989"
    },
    {
        "rank": "97",
        "imdbId": "tt0083658",
        "checked": false,
        "favorite": false,
        "movieTitle": "Blade Runner",
        "posterPath": "/63N9uy8nd9j7Eog2axPQ8lbr3Wj.jpg",
        "overview": "In the smog-choked dystopian Los Angeles of 2019, blade runner Rick Deckard is called out of retirement to terminate a quartet of replicants who have escaped to Earth seeking their creator for a way to extend their short life spans.",
        "id": "tt0083658",
        "year": "1982"
    },
    {
        "rank": "98",
        "imdbId": "tt0035575",
        "checked": false,
        "favorite": false,
        "movieTitle": "Yankee Doodle Dandy",
        "posterPath": "/cqLLIyJFjLr6jGOxWVEHG11WGzB.jpg",
        "overview": "A film of the life of the renowned musical composer, playwright, actor, dancer and singer George M. Cohan.",
        "id": "tt0035575",
        "year": "1942"
    },
    {
        "rank": "99",
        "imdbId": "tt0114709",
        "checked": false,
        "favorite": false,
        "movieTitle": "Toy Story",
        "posterPath": "/uXDfjJbdP4ijW5hWSBrPrlKpxab.jpg",
        "overview": "Led by Woody, Andy's toys live happily in his room until Andy's birthday brings Buzz Lightyear onto the scene. Afraid of losing his place in Andy's heart, Woody plots against Buzz. But when circumstances separate Buzz and Woody from their owner, the duo eventually learns to put aside their differences.",
        "id": "tt0114709",
        "year": "1995"
    },
    {
        "rank": "100",
        "imdbId": "tt0052618",
        "checked": false,
        "favorite": false,
        "movieTitle": "Ben-Hur",
        "posterPath": "/m4WQ1dBIrEIHZNCoAjdpxwSKWyH.jpg",
        "overview": "In 25 AD,Judah Ben-Hur, a Jew in ancient Judea, opposes the occupying Roman empire.  Falsely accused by a Roman childhood friend-turned-overlord of trying to kill the Roman governor, he is put into slavery and his mother and sister are taken away as prisoners.  Three years later and freed by a grateful Roman galley commander whom he has rescued from drowning, he becomes an expert charioteer for Rome, all the while plotting to return to Judea, find and rescue his family, and avenge himself on his former friend.  All the while, the form and work of Jesus move in the background of his life...",
        "id": "tt0052618",
        "year": "1959"
    }
]